docs/benchmark/results-luring-vs-nginx-20260727/raw/luring-1000-r3.txt
Running 10s test @ http://127.0.0.1:8081/
  8 threads and 1000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     6.21ms    1.01ms  32.90ms   76.50%
    Req/Sec    20.19k     0.93k   22.52k    73.38%
  Latency Distribution
     50%    6.09ms
     75%    6.67ms
     90%    7.37ms
     99%    9.55ms
  1607066 requests in 10.03s, 1.00GB read
Requests/sec: 160282.38
Transfer/sec:    102.41MB