docs/benchmark/results-luring-vs-nginx-20260727/raw/luring-2000-r1.txt
Running 10s test @ http://127.0.0.1:8081/
  8 threads and 2000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    13.06ms    1.87ms 102.62ms   77.92%
    Req/Sec    19.22k     0.94k   21.08k    72.62%
  Latency Distribution
     50%   12.88ms
     75%   13.97ms
     90%   15.13ms
     99%   17.91ms
  1530418 requests in 10.04s, 0.95GB read
Requests/sec: 152506.30
Transfer/sec:     97.45MB