docs/benchmark/results-luring-vs-nginx-20260727/raw/luring-2000-r2.txt
Running 10s test @ http://127.0.0.1:8081/
  8 threads and 2000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    13.43ms    2.19ms 119.39ms   84.12%
    Req/Sec    18.70k     0.97k   20.44k    74.62%
  Latency Distribution
     50%   13.25ms
     75%   14.34ms
     90%   15.46ms
     99%   19.66ms
  1489130 requests in 10.03s, 0.93GB read
Requests/sec: 148495.89
Transfer/sec:     94.88MB