docs/benchmark/results-luring-vs-nginx-20260727/raw/luring-500-r3.txt
Running 10s test @ http://127.0.0.1:8081/
  8 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.72ms    0.92ms  20.22ms   82.26%
    Req/Sec    23.03k     1.24k   26.56k    75.88%
  Latency Distribution
     50%    2.61ms
     75%    3.00ms
     90%    3.59ms
     99%    6.19ms
  1833454 requests in 10.01s, 1.14GB read
Requests/sec: 183075.78
Transfer/sec:    116.98MB