docs/benchmark/results-luring-vs-nginx-20260727/raw/reactor-1000-r1.txt
Running 10s test @ http://127.0.0.1:8080/
  8 threads and 1000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     6.30ms    1.42ms  21.43ms   71.41%
    Req/Sec    19.94k     1.07k   21.75k    76.00%
  Latency Distribution
     50%    5.73ms
     75%    7.34ms
     90%    8.48ms
     99%    9.72ms
  1586926 requests in 10.02s, 0.99GB read
Requests/sec: 158350.22
Transfer/sec:    101.18MB