docs/benchmark/results-luring-vs-nginx-20260727/raw/reactor-1000-r2.txt
Running 10s test @ http://127.0.0.1:8080/
  8 threads and 1000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     6.31ms    1.43ms  28.34ms   74.06%
    Req/Sec    19.91k     1.39k   21.74k    82.75%
  Latency Distribution
     50%    6.11ms
     75%    6.97ms
     90%    8.15ms
     99%   10.53ms
  1584495 requests in 10.03s, 0.99GB read
Requests/sec: 157951.27
Transfer/sec:    100.92MB