docs/benchmark/results-luring-vs-nginx-20260727/raw/reactor-500-r1.txt
Running 10s test @ http://127.0.0.1:8080/
  8 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.77ms  742.22us   8.10ms   68.45%
    Req/Sec    22.49k     5.66k  179.95k    99.75%
  Latency Distribution
     50%    2.47ms
     75%    3.47ms
     90%    3.83ms
     99%    4.23ms
  1792658 requests in 10.10s, 1.12GB read
Requests/sec: 177486.83
Transfer/sec:    113.41MB