docs/benchmark/results-luring-vs-nginx-20260727/raw/reactor-500-r2.txt
Running 10s test @ http://127.0.0.1:8080/
  8 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.85ms  761.09us   9.60ms   64.90%
    Req/Sec    21.87k     1.05k   24.64k    70.88%
  Latency Distribution
     50%    2.56ms
     75%    3.36ms
     90%    4.05ms
     99%    4.46ms
  1740964 requests in 10.01s, 1.09GB read
Requests/sec: 173929.32
Transfer/sec:    111.13MB